OpenNuvoton/NUC123BSP/SampleCode/StdDriver/USBD_Audio_HID_Transfer/usbd_audio.c
        if(u32IntSts & USBD_INTSTS_EP2)
        {
            /* Clear event flag */
            USBD_CLR_INT_FLAG(USBD_INTSTS_EP2);

            // Isochronous IN
            EP2_Handler();
        }

        if(u32IntSts & USBD_INTSTS_EP3)
        {
            /* Clear event flag */
            USBD_CLR_INT_FLAG(USBD_INTSTS_EP3);

            // Isochronous OUT
            EP3_Handler();
        }

        if(u32IntSts & USBD_INTSTS_EP4)
        {
            /* Clear event flag */
            USBD_CLR_INT_FLAG(USBD_INTSTS_EP4);
            
            EP4_Handler();
        }

        if(u32IntSts & USBD_INTSTS_EP5)
        {
            /* Clear event flag */
            USBD_CLR_INT_FLAG(USBD_INTSTS_EP5);
            
            EP5_Handler();
        }

        if(u32IntSts & USBD_INTSTS_EP6)
        {
            /* Clear event flag */
            USBD_CLR_INT_FLAG(USBD_INTSTS_EP6);
            
            EP6_Handler();
        }

        if(u32IntSts & USBD_INTSTS_EP7)
        {
            /* Clear event flag */
            USBD_CLR_INT_FLAG(USBD_INTSTS_EP7);
            
            EP7_Handler();
        }
    }

}

/**
 * @brief       Isochronous In Handler
 *
 * @param[in]   None
 *
 * @return      None
 *
 * @details     This function is used to process Isochronous In event for recording.
 */

void ISO_IN_HANDLER(void)
{
    /* ISO IN transfer ACK */
    if(g_usbd_UsbAudioState == UAC_START_AUDIO_RECORD)
    {
        UAC_DeviceEnable(UAC_MICROPHONE);
        g_usbd_UsbAudioState = UAC_PROCESSING_AUDIO_RECORD;
    }
    else if(g_usbd_UsbAudioState == UAC_PROCESSING_AUDIO_RECORD)
        g_usbd_UsbAudioState = UAC_BUSY_AUDIO_RECORD;

    if(g_usbd_UsbAudioState == UAC_BUSY_AUDIO_RECORD)
        UAC_SendRecData();
    else
        USBD_SET_PAYLOAD_LEN(ISO_IN_EP, 0);

}

/**
 * @brief       Isochronous Out Handler (ISO OUT interrupt handler)
 *
 * @param[in]   None
 *
 * @return      None
 *
 * @details     This function is used to process Isochronous Out event (ISO OUT transfer ACK) for play audio.
 */
void ISO_OUT_HANDLER(void)
{

    uint32_t u32Len;
    int32_t i;
    uint8_t *pu8Buf;
    uint8_t *pu8Src;
    uint32_t u32Idx;

    /* Get the address in USB buffer */
    pu8Src = (uint8_t *)((uint32_t)USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(ISO_OUT_EP));

    /* Prepare for nex OUT packet */
    USBD_SET_PAYLOAD_LEN(ISO_OUT_EP, ISO_OUT_MAX_PKT_SIZE);

    /* Get the temp buffer */
    pu8Buf = (uint8_t *)g_au32UsbTmpBuf;

    /* Calculate byte size of play data */
    u32Len = PLAY_RATE / 1000 * PLAY_CHANNELS * 2;

    /* Copy all data from USB buffer to SRAM buffer */
    /* We assume the source data are 4 bytes alignment. */
    for(i = 0; i < u32Len; i += 4)
    {
        pu8Buf[i] = pu8Src[i];
        pu8Buf[i + 1] = pu8Src[i + 1];
        pu8Buf[i + 2] = pu8Src[i + 2];
        pu8Buf[i + 3] = pu8Src[i + 3];
    }

    /* Calculate word length */
    u32Len = u32Len >> 2;
    for(i = 0; i < u32Len; i++)
    {
        /* Check ring buffer turn around */
        u32Idx = g_u32PlayPos_In + 1;
        if(u32Idx >= BUF_LEN)
            u32Idx = 0;

        /* Check if buffer full */
        if(u32Idx != g_u32PlayPos_Out)
        {
            /* Update play ring buffer only when it is not full */
            g_au32PcmPlayBuf[u32Idx] = g_au32UsbTmpBuf[i];

            /* Update IN index */
            g_u32PlayPos_In = u32Idx;
        }
    }

    if(g_u8PlayEn == 0)
    {
        /* Start play data output through I2S only when we have enough data in buffer */
        if(GetSamplesInBuf() > BUF_LEN / 2)
            g_u8PlayEn = 1;
    }


}

/**
 * @brief       HID Transfer In Handler (HID IN interrupt handler)
 *
 * @param[in]   None
 *
 * @return      None
 *
 * @details     This function is used to process HID Transfer In event (HID IN interrupt) for HID Transfer.
 */
void HID_TRANS_IN_HANDLER(void)
{
    HidTransferIn();
}

/**
 * @brief       HID Transfer Out Handler (HID OUT interrupt handler)
 *
 * @param[in]   None
 *
 * @return      None
 *
 * @details     This function is used to process HID Transfer Out event (HID OUT interrupt) for HID Transfer.
 */
void HID_TRANS_OUT_HANDLER(void)
{
    
    uint8_t *ptr;
    /* Interrupt OUT */
    ptr = (uint8_t *)(USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(HID_TRANS_OUT_EP));
    HidTransferOut(ptr, USBD_GET_PAYLOAD_LEN(HID_TRANS_OUT_EP));
    USBD_SET_PAYLOAD_LEN(HID_TRANS_OUT_EP, HID_TRANS_OUT_MAX_PKT_SIZE);
}


/**
 * @brief       HID Keyboard In Handler (HID IN interrupt handler)
 *
 * @param[in]   None
 *
 * @return      None
 *
 * @details     This function is used to process HID keyboard IN event (HID IN interrupt) for HID keyboard.
 */
void HID_KEY_IN_HANDLER(void)
{
    g_u8KeyReady = 1;
}



/**
 * @brief       HID Media Key In Handler (HID IN interrupt handler)
 *
 * @param[in]   None
 *
 * @return      None
 *
 * @details     This function is used to process HID Media Key IN event (HID IN interrupt) for HID media key.
 */void HID_MEDIA_IN_HANDLER(void)
{
    g_u8MediaKeyReady = 1;
}

/*--------------------------------------------------------------------------*/
/**
 * @brief       UAC Class Initial
 *
 * @param[in]   None
 *
 * @return      None
 *
 * @details     This function is used to configure endpoints for UAC class
 */
void UAC_Init(void)
{
    /* Init setup packet buffer */
    /* Buffer for setup packet -> [0 ~ 0x7] */
    USBD->STBUFSEG = SETUP_BUF_BASE;

    /*****************************************************/
    /* EP0 ==> control IN endpoint, address 0 */
    USBD_CONFIG_EP(EP0, USBD_CFG_CSTALL | USBD_CFG_EPMODE_IN | 0);
    /* Buffer range for EP0 */
    USBD_SET_EP_BUF_ADDR(EP0, EP0_BUF_BASE);

    /* EP1 ==> control OUT endpoint, address 0 */
    USBD_CONFIG_EP(EP1, USBD_CFG_CSTALL | USBD_CFG_EPMODE_OUT | 0);
    /* Buffer range for EP1 */
    USBD_SET_EP_BUF_ADDR(EP1, EP1_BUF_BASE);

    /*****************************************************/
    /* Initial all endpoint buffer                       */
    /* Buffer range for EP2 */
    USBD_SET_EP_BUF_ADDR(EP2, EP2_BUF_BASE);
    /* Buffer range for EP3 */
    USBD_SET_EP_BUF_ADDR(EP3, EP3_BUF_BASE);
    /* Buffer range for EP4 */
    USBD_SET_EP_BUF_ADDR(EP4, EP4_BUF_BASE);
    /* Buffer offset for EP5 */
    USBD_SET_EP_BUF_ADDR(EP5, EP5_BUF_BASE);
    /* Buffer offset for EP6 */
    USBD_SET_EP_BUF_ADDR(EP6, EP6_BUF_BASE);
    /* Buffer range for EP7 */
    USBD_SET_EP_BUF_ADDR(EP7, EP7_BUF_BASE);
    
    
    /*****************************************************/
    /* EP6 ==> Isochronous IN endpoint */
    USBD_CONFIG_EP(ISO_IN_EP, USBD_CFG_EPMODE_IN | ISO_IN_EP_NUM | USBD_CFG_TYPE_ISO);

    /*****************************************************/
    /* EP5 ==> Isochronous OUT endpoint */
    USBD_CONFIG_EP(ISO_OUT_EP, USBD_CFG_EPMODE_OUT | ISO_OUT_EP_NUM | USBD_CFG_TYPE_ISO);
    /* trigger receive OUT data */
    USBD_SET_PAYLOAD_LEN(ISO_OUT_EP, ISO_OUT_MAX_PKT_SIZE);

    /*****************************************************/
    /* EP2 ==> Interrupt IN endpoint */
    USBD_CONFIG_EP(HID_TRANS_IN_EP, USBD_CFG_EPMODE_IN | HID_TRANS_IN_EP_NUM);
    
    /*****************************************************/
    /* EP3 ==> Interrupt OUT endpoint */
    USBD_CONFIG_EP(HID_TRANS_OUT_EP, USBD_CFG_EPMODE_OUT | HID_TRANS_OUT_EP_NUM);
    /* trigger to receive OUT data of HID transfer */
    USBD_SET_PAYLOAD_LEN(HID_TRANS_OUT_EP, HID_TRANS_OUT_MAX_PKT_SIZE);
    
    /*****************************************************/
    /* EP4 ==> Interrupt IN endpoint */
    USBD_CONFIG_EP(HID_KEY_IN_EP, USBD_CFG_EPMODE_IN | HID_KEY_IN_EP_NUM);

    /*****************************************************/
    /* EP7 ==> Interrupt IN endpoint */
    USBD_CONFIG_EP(HID_MEDIA_IN_EP, USBD_CFG_EPMODE_IN | HID_MEDIA_IN_EP_NUM);
    
